ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb55xx.h
#define SRAM1_BASE             SRAM_BASE                 /*!< SRAM1(up to 192 KB) base address */
#define SRAM2A_BASE            (SRAM_BASE + 0x00030000UL)/*!< SRAM2A(32 KB) base address       */
#define SRAM2B_BASE            (SRAM_BASE + 0x00038000UL)/*!< SRAM2B(32 KB) base address       */

/* Memory Size */
#define FLASH_SIZE              (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0x07FFUL)) << 10U)
#define SRAM1_SIZE              0x00030000UL   /*!< SRAM1 default size : 192 kB  */
#define SRAM2A_SIZE             0x00008000UL   /*!< SRAM2a default size : 32 kB  */
#define SRAM2B_SIZE             0x00008000UL   /*!< SRAM2b default size : 32 kB  */

/* End addresses */
#define SRAM1_END_ADDR         (0x2002FFFFUL)  /*!< SRAM1               : 192KB (0x20000000 – 0x2002FFFF) */
#define SRAM2A_END_ADDR        (0x20037FFFUL)  /*!< SRAM2a (backup)     :  32KB (0x20030000 – 0x20037FFF) */
#define SRAM2B_END_ADDR        (0x2003FFFFUL)  /*!< SRAM2b (non-backup) :  32KB (0x20038000 – 0x2003FFFF) */

#define SYSTEM_MEMORY_END_ADDR (0x1FFF6FFFUL)  /*!< System Memory : 28KB (0x1FFF0000 – 0x1FFF6FFF)  */
#define OTP_AREA_END_ADDR      (0x1FFF73FFUL)  /*!< OTP area : 1KB (0x1FFF7000 – 0x1FFF73FF)        */
#define OPTION_BYTE_END_ADDR   (0x1FFF8FFFUL)  /*!< Option Bytes : 4KB (0x1FFF8000 – 0x1FFF8FFF)    */
#define ENGI_BYTE_END_ADDR     (0x1FFF7FFFUL)  /*!< Engi Bytes : 3kB (0x1FFF7400 – 0x1FFF7FFF)      */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000UL)
#define AHB4PERIPH_BASE       (PERIPH_BASE + 0x18000000UL)
#define APB3PERIPH_BASE       (PERIPH_BASE + 0x20000000UL)
#define AHB3PERIPH_BASE       (PERIPH_BASE + 0x50000000UL)

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x00000000UL)
#define LCD_BASE              (APB1PERIPH_BASE + 0x00002400UL)
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800UL)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00UL)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000UL)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800UL)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400UL)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x00005C00UL)
#define CRS_BASE              (APB1PERIPH_BASE + 0x00006000UL)
#define USB1_BASE             (APB1PERIPH_BASE + 0x00006800UL)
#define USB1_PMAADDR          (APB1PERIPH_BASE + 0x00006C00UL)
#define LPTIM1_BASE           (APB1PERIPH_BASE + 0x00007C00UL)
#define LPUART1_BASE          (APB1PERIPH_BASE + 0x00008000UL)
#define LPTIM2_BASE           (APB1PERIPH_BASE + 0x00009400UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x00000000UL)
#define VREFBUF_BASE          (APB2PERIPH_BASE + 0x00000030UL)
#define COMP1_BASE            (APB2PERIPH_BASE + 0x00000200UL)
#define COMP2_BASE            (APB2PERIPH_BASE + 0x00000204UL)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x00002C00UL)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000UL)
#define USART1_BASE           (APB2PERIPH_BASE + 0x00003800UL)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x00004400UL)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x00004800UL)
#define SAI1_BASE             (APB2PERIPH_BASE + 0x00005400UL)
#define SAI1_Block_A_BASE     (SAI1_BASE + 0x0000004UL)
#define SAI1_Block_B_BASE     (SAI1_BASE + 0x0000024UL)

/*!< AHB1 peripherals */
#define DMA1_BASE                (AHB1PERIPH_BASE + 0x00000000UL)
#define DMA2_BASE                (AHB1PERIPH_BASE + 0x00000400UL)
#define DMAMUX1_BASE             (AHB1PERIPH_BASE + 0x00000800UL)
#define CRC_BASE                 (AHB1PERIPH_BASE + 0x00003000UL)
#define TSC_BASE                 (AHB1PERIPH_BASE + 0x00004000UL)

#define DMA1_Channel1_BASE       (DMA1_BASE + 0x00000008UL)
#define DMA1_Channel2_BASE       (DMA1_BASE + 0x0000001CUL)
#define DMA1_Channel3_BASE       (DMA1_BASE + 0x00000030UL)
#define DMA1_Channel4_BASE       (DMA1_BASE + 0x00000044UL)
#define DMA1_Channel5_BASE       (DMA1_BASE + 0x00000058UL)
#define DMA1_Channel6_BASE       (DMA1_BASE + 0x0000006CUL)
#define DMA1_Channel7_BASE       (DMA1_BASE + 0x00000080UL)

#define DMA2_Channel1_BASE       (DMA2_BASE + 0x00000008UL)
#define DMA2_Channel2_BASE       (DMA2_BASE + 0x0000001CUL)
#define DMA2_Channel3_BASE       (DMA2_BASE + 0x00000030UL)
#define DMA2_Channel4_BASE       (DMA2_BASE + 0x00000044UL)
#define DMA2_Channel5_BASE       (DMA2_BASE + 0x00000058UL)
#define DMA2_Channel6_BASE       (DMA2_BASE + 0x0000006CUL)
#define DMA2_Channel7_BASE       (DMA2_BASE + 0x00000080UL)

#define DMAMUX1_Channel0_BASE    (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE    (DMAMUX1_BASE + 0x00000004UL)
#define DMAMUX1_Channel2_BASE    (DMAMUX1_BASE + 0x00000008UL)
#define DMAMUX1_Channel3_BASE    (DMAMUX1_BASE + 0x0000000CUL)
#define DMAMUX1_Channel4_BASE    (DMAMUX1_BASE + 0x00000010UL)
#define DMAMUX1_Channel5_BASE    (DMAMUX1_BASE + 0x00000014UL)
#define DMAMUX1_Channel6_BASE    (DMAMUX1_BASE + 0x00000018UL)
#define DMAMUX1_Channel7_BASE    (DMAMUX1_BASE + 0x0000001CUL)
#define DMAMUX1_Channel8_BASE    (DMAMUX1_BASE + 0x00000020UL)
#define DMAMUX1_Channel9_BASE    (DMAMUX1_BASE + 0x00000024UL)
#define DMAMUX1_Channel10_BASE   (DMAMUX1_BASE + 0x00000028UL)
#define DMAMUX1_Channel11_BASE   (DMAMUX1_BASE + 0x0000002CUL)
#define DMAMUX1_Channel12_BASE   (DMAMUX1_BASE + 0x00000030UL)
#define DMAMUX1_Channel13_BASE   (DMAMUX1_BASE + 0x00000034UL)

#define DMAMUX1_RequestGenerator0_BASE  (DMAMUX1_BASE + 0x00000100UL)
#define DMAMUX1_RequestGenerator1_BASE  (DMAMUX1_BASE + 0x00000104UL)
#define DMAMUX1_RequestGenerator2_BASE  (DMAMUX1_BASE + 0x00000108UL)
#define DMAMUX1_RequestGenerator3_BASE  (DMAMUX1_BASE + 0x0000010CUL)

#define DMAMUX1_ChannelStatus_BASE      (DMAMUX1_BASE + 0x00000080UL)
#define DMAMUX1_RequestGenStatus_BASE   (DMAMUX1_BASE + 0x00000140UL)

/*!< AHB2 peripherals */
#define IOPORT_BASE         (AHB2PERIPH_BASE + 0x00000000UL)
#define GPIOA_BASE          (IOPORT_BASE + 0x00000000UL)
#define GPIOB_BASE          (IOPORT_BASE + 0x00000400UL)
#define GPIOC_BASE          (IOPORT_BASE + 0x00000800UL)
#define GPIOD_BASE          (IOPORT_BASE + 0x00000C00UL)
#define GPIOE_BASE          (IOPORT_BASE + 0x00001000UL)
#define GPIOH_BASE          (IOPORT_BASE + 0x00001C00UL)

