ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb55xx.h
/********************  Bit definition for PWR_PUCRC register  *****************/
#define PWR_PUCRC_PC0_Pos              (0U)                                    
#define PWR_PUCRC_PC0_Msk              (0x1UL << PWR_PUCRC_PC0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRC_PC0                  PWR_PUCRC_PC0_Msk                       /*!< Pin PC0 Pull-Up set */
#define PWR_PUCRC_PC1_Pos              (1U)                                    
#define PWR_PUCRC_PC1_Msk              (0x1UL << PWR_PUCRC_PC1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRC_PC1                  PWR_PUCRC_PC1_Msk                       /*!< Pin PC1 Pull-Up set */
#define PWR_PUCRC_PC2_Pos              (2U)                                    
#define PWR_PUCRC_PC2_Msk              (0x1UL << PWR_PUCRC_PC2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRC_PC2                  PWR_PUCRC_PC2_Msk                       /*!< Pin PC2 Pull-Up set */
#define PWR_PUCRC_PC3_Pos              (3U)                                    
#define PWR_PUCRC_PC3_Msk              (0x1UL << PWR_PUCRC_PC3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRC_PC3                  PWR_PUCRC_PC3_Msk                       /*!< Pin PC3 Pull-Up set */
#define PWR_PUCRC_PC4_Pos              (4U)                                    
#define PWR_PUCRC_PC4_Msk              (0x1UL << PWR_PUCRC_PC4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRC_PC4                  PWR_PUCRC_PC4_Msk                       /*!< Pin PC4 Pull-Up set */
#define PWR_PUCRC_PC5_Pos              (5U)                                    
#define PWR_PUCRC_PC5_Msk              (0x1UL << PWR_PUCRC_PC5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRC_PC5                  PWR_PUCRC_PC5_Msk                       /*!< Pin PC5 Pull-Up set */
#define PWR_PUCRC_PC6_Pos              (6U)                                    
#define PWR_PUCRC_PC6_Msk              (0x1UL << PWR_PUCRC_PC6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRC_PC6                  PWR_PUCRC_PC6_Msk                       /*!< Pin PC6 Pull-Up set */
#define PWR_PUCRC_PC7_Pos              (7U)                                    
#define PWR_PUCRC_PC7_Msk              (0x1UL << PWR_PUCRC_PC7_Pos)            /*!< 0x00000080 */
#define PWR_PUCRC_PC7                  PWR_PUCRC_PC7_Msk                       /*!< Pin PC7 Pull-Up set */
#define PWR_PUCRC_PC8_Pos              (8U)                                    
#define PWR_PUCRC_PC8_Msk              (0x1UL << PWR_PUCRC_PC8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRC_PC8                  PWR_PUCRC_PC8_Msk                       /*!< Pin PC8 Pull-Up set */
#define PWR_PUCRC_PC9_Pos              (9U)                                    
#define PWR_PUCRC_PC9_Msk              (0x1UL << PWR_PUCRC_PC9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRC_PC9                  PWR_PUCRC_PC9_Msk                       /*!< Pin PC9 Pull-Up set */
#define PWR_PUCRC_PC10_Pos             (10U)                                   
#define PWR_PUCRC_PC10_Msk             (0x1UL << PWR_PUCRC_PC10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRC_PC10                 PWR_PUCRC_PC10_Msk                      /*!< Pin PC10 Pull-Up set */
#define PWR_PUCRC_PC11_Pos             (11U)                                   
#define PWR_PUCRC_PC11_Msk             (0x1UL << PWR_PUCRC_PC11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRC_PC11                 PWR_PUCRC_PC11_Msk                      /*!< Pin PC11 Pull-Up set */
#define PWR_PUCRC_PC12_Pos             (12U)                                   
#define PWR_PUCRC_PC12_Msk             (0x1UL << PWR_PUCRC_PC12_Pos)           /*!< 0x00001000 */
#define PWR_PUCRC_PC12                 PWR_PUCRC_PC12_Msk                      /*!< Pin PC12 Pull-Up set */
#define PWR_PUCRC_PC13_Pos             (13U)                                   
#define PWR_PUCRC_PC13_Msk             (0x1UL << PWR_PUCRC_PC13_Pos)           /*!< 0x00002000 */
#define PWR_PUCRC_PC13                 PWR_PUCRC_PC13_Msk                      /*!< Pin PC13 Pull-Up set */
#define PWR_PUCRC_PC14_Pos             (14U)                                   
#define PWR_PUCRC_PC14_Msk             (0x1UL << PWR_PUCRC_PC14_Pos)           /*!< 0x00004000 */
#define PWR_PUCRC_PC14                 PWR_PUCRC_PC14_Msk                      /*!< Pin PC14 Pull-Up set */
#define PWR_PUCRC_PC15_Pos             (15U)                                   
#define PWR_PUCRC_PC15_Msk             (0x1UL << PWR_PUCRC_PC15_Pos)           /*!< 0x00008000 */
#define PWR_PUCRC_PC15                 PWR_PUCRC_PC15_Msk                      /*!< Pin PC15 Pull-Up set */

/********************  Bit definition for PWR_PDCRC register  *****************/
#define PWR_PDCRC_PC0_Pos              (0U)                                    
#define PWR_PDCRC_PC0_Msk              (0x1UL << PWR_PDCRC_PC0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRC_PC0                  PWR_PDCRC_PC0_Msk                       /*!< Pin PC0 Pull-Down set */
#define PWR_PDCRC_PC1_Pos              (1U)                                    
#define PWR_PDCRC_PC1_Msk              (0x1UL << PWR_PDCRC_PC1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRC_PC1                  PWR_PDCRC_PC1_Msk                       /*!< Pin PC1 Pull-Down set */
#define PWR_PDCRC_PC2_Pos              (2U)                                    
#define PWR_PDCRC_PC2_Msk              (0x1UL << PWR_PDCRC_PC2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRC_PC2                  PWR_PDCRC_PC2_Msk                       /*!< Pin PC2 Pull-Down set */
#define PWR_PDCRC_PC3_Pos              (3U)                                    
#define PWR_PDCRC_PC3_Msk              (0x1UL << PWR_PDCRC_PC3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRC_PC3                  PWR_PDCRC_PC3_Msk                       /*!< Pin PC3 Pull-Down set */
#define PWR_PDCRC_PC4_Pos              (4U)                                    
#define PWR_PDCRC_PC4_Msk              (0x1UL << PWR_PDCRC_PC4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRC_PC4                  PWR_PDCRC_PC4_Msk                       /*!< Pin PC4 Pull-Down set */
#define PWR_PDCRC_PC5_Pos              (5U)                                    
#define PWR_PDCRC_PC5_Msk              (0x1UL << PWR_PDCRC_PC5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRC_PC5                  PWR_PDCRC_PC5_Msk                       /*!< Pin PC5 Pull-Down set */
#define PWR_PDCRC_PC6_Pos              (6U)                                    
#define PWR_PDCRC_PC6_Msk              (0x1UL << PWR_PDCRC_PC6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRC_PC6                  PWR_PDCRC_PC6_Msk                       /*!< Pin PC6 Pull-Down set */
#define PWR_PDCRC_PC7_Pos              (7U)                                    
#define PWR_PDCRC_PC7_Msk              (0x1UL << PWR_PDCRC_PC7_Pos)            /*!< 0x00000080 */
#define PWR_PDCRC_PC7                  PWR_PDCRC_PC7_Msk                       /*!< Pin PC7 Pull-Down set */
#define PWR_PDCRC_PC8_Pos              (8U)                                    
#define PWR_PDCRC_PC8_Msk              (0x1UL << PWR_PDCRC_PC8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRC_PC8                  PWR_PDCRC_PC8_Msk                       /*!< Pin PC8 Pull-Down set */
#define PWR_PDCRC_PC9_Pos              (9U)                                    
#define PWR_PDCRC_PC9_Msk              (0x1UL << PWR_PDCRC_PC9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRC_PC9                  PWR_PDCRC_PC9_Msk                       /*!< Pin PC9 Pull-Down set */
#define PWR_PDCRC_PC10_Pos             (10U)                                   
#define PWR_PDCRC_PC10_Msk             (0x1UL << PWR_PDCRC_PC10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRC_PC10                 PWR_PDCRC_PC10_Msk                      /*!< Pin PC10 Pull-Down set */
#define PWR_PDCRC_PC11_Pos             (11U)                                   
#define PWR_PDCRC_PC11_Msk             (0x1UL << PWR_PDCRC_PC11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRC_PC11                 PWR_PDCRC_PC11_Msk                      /*!< Pin PC11 Pull-Down set */
#define PWR_PDCRC_PC12_Pos             (12U)                                   
#define PWR_PDCRC_PC12_Msk             (0x1UL << PWR_PDCRC_PC12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRC_PC12                 PWR_PDCRC_PC12_Msk                      /*!< Pin PC12 Pull-Down set */
#define PWR_PDCRC_PC13_Pos             (13U)                                   
#define PWR_PDCRC_PC13_Msk             (0x1UL << PWR_PDCRC_PC13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRC_PC13                 PWR_PDCRC_PC13_Msk                      /*!< Pin PC13 Pull-Down set */
#define PWR_PDCRC_PC14_Pos             (14U)                                   
#define PWR_PDCRC_PC14_Msk             (0x1UL << PWR_PDCRC_PC14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRC_PC14                 PWR_PDCRC_PC14_Msk                      /*!< Pin PC14 Pull-Down set */
#define PWR_PDCRC_PC15_Pos             (15U)                                   
#define PWR_PDCRC_PC15_Msk             (0x1UL << PWR_PDCRC_PC15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRC_PC15                 PWR_PDCRC_PC15_Msk                      /*!< Pin PC15 Pull-Down set */

