ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb55xx.h
/********************  Bit definition for PWR_PUCRD register  *****************/
#define PWR_PUCRD_PD0_Pos              (0U)                                    
#define PWR_PUCRD_PD0_Msk              (0x1UL << PWR_PUCRD_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRD_PD0                  PWR_PUCRD_PD0_Msk                       /*!< Pin PD0 Pull-Up set */
#define PWR_PUCRD_PD1_Pos              (1U)                                    
#define PWR_PUCRD_PD1_Msk              (0x1UL << PWR_PUCRD_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRD_PD1                  PWR_PUCRD_PD1_Msk                       /*!< Pin PD1 Pull-Up set */
#define PWR_PUCRD_PD2_Pos              (2U)                                    
#define PWR_PUCRD_PD2_Msk              (0x1UL << PWR_PUCRD_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRD_PD2                  PWR_PUCRD_PD2_Msk                       /*!< Pin PD2 Pull-Up set */
#define PWR_PUCRD_PD3_Pos              (3U)                                    
#define PWR_PUCRD_PD3_Msk              (0x1UL << PWR_PUCRD_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRD_PD3                  PWR_PUCRD_PD3_Msk                       /*!< Pin PD3 Pull-Up set */
#define PWR_PUCRD_PD4_Pos              (4U)                                    
#define PWR_PUCRD_PD4_Msk              (0x1UL << PWR_PUCRD_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRD_PD4                  PWR_PUCRD_PD4_Msk                       /*!< Pin PD4 Pull-Up set */
#define PWR_PUCRD_PD5_Pos              (5U)                                    
#define PWR_PUCRD_PD5_Msk              (0x1UL << PWR_PUCRD_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRD_PD5                  PWR_PUCRD_PD5_Msk                       /*!< Pin PD5 Pull-Up set */
#define PWR_PUCRD_PD6_Pos              (6U)                                    
#define PWR_PUCRD_PD6_Msk              (0x1UL << PWR_PUCRD_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRD_PD6                  PWR_PUCRD_PD6_Msk                       /*!< Pin PD6 Pull-Up set */
#define PWR_PUCRD_PD8_Pos              (8U)                                    
#define PWR_PUCRD_PD8_Msk              (0x1UL << PWR_PUCRD_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRD_PD8                  PWR_PUCRD_PD8_Msk                       /*!< Pin PD8 Pull-Up set */
#define PWR_PUCRD_PD9_Pos              (9U)                                    
#define PWR_PUCRD_PD9_Msk              (0x1UL << PWR_PUCRD_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRD_PD9                  PWR_PUCRD_PD9_Msk                       /*!< Pin PD9 Pull-Up set */
#define PWR_PUCRD_PD10_Pos             (10U)                                   
#define PWR_PUCRD_PD10_Msk             (0x1UL << PWR_PUCRD_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRD_PD10                 PWR_PUCRD_PD10_Msk                      /*!< Pin PD10 Pull-Up set */
#define PWR_PUCRD_PD11_Pos             (11U)                                   
#define PWR_PUCRD_PD11_Msk             (0x1UL << PWR_PUCRD_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRD_PD11                 PWR_PUCRD_PD11_Msk                      /*!< Pin PD11 Pull-Up set */
#define PWR_PUCRD_PD12_Pos             (12U)                                   
#define PWR_PUCRD_PD12_Msk             (0x1UL << PWR_PUCRD_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PUCRD_PD12                 PWR_PUCRD_PD12_Msk                      /*!< Pin PD12 Pull-Up set */
#define PWR_PUCRD_PD13_Pos             (13U)                                   
#define PWR_PUCRD_PD13_Msk             (0x1UL << PWR_PUCRD_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PUCRD_PD13                 PWR_PUCRD_PD13_Msk                      /*!< Pin PD13 Pull-Up set */
#define PWR_PUCRD_PD14_Pos             (14U)                                   
#define PWR_PUCRD_PD14_Msk             (0x1UL << PWR_PUCRD_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PUCRD_PD14                 PWR_PUCRD_PD14_Msk                      /*!< Pin PD14 Pull-Up set */
#define PWR_PUCRD_PD15_Pos             (15U)                                   
#define PWR_PUCRD_PD15_Msk             (0x1UL << PWR_PUCRD_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PUCRD_PD15                 PWR_PUCRD_PD15_Msk                      /*!< Pin PD15 Pull-Up set */

/********************  Bit definition for PWR_PDCRD register  *****************/
#define PWR_PDCRD_PD0_Pos              (0U)                                    
#define PWR_PDCRD_PD0_Msk              (0x1UL << PWR_PDCRD_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRD_PD0                  PWR_PDCRD_PD0_Msk                       /*!< Pin PD0 Pull-Down set */
#define PWR_PDCRD_PD1_Pos              (1U)                                    
#define PWR_PDCRD_PD1_Msk              (0x1UL << PWR_PDCRD_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRD_PD1                  PWR_PDCRD_PD1_Msk                       /*!< Pin PD1 Pull-Down set */
#define PWR_PDCRD_PD2_Pos              (2U)                                    
#define PWR_PDCRD_PD2_Msk              (0x1UL << PWR_PDCRD_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRD_PD2                  PWR_PDCRD_PD2_Msk                       /*!< Pin PD2 Pull-Down set */
#define PWR_PDCRD_PD3_Pos              (3U)                                    
#define PWR_PDCRD_PD3_Msk              (0x1UL << PWR_PDCRD_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRD_PD3                  PWR_PDCRD_PD3_Msk                       /*!< Pin PD3 Pull-Down set */
#define PWR_PDCRD_PD4_Pos              (4U)                                    
#define PWR_PDCRD_PD4_Msk              (0x1UL << PWR_PDCRD_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRD_PD4                  PWR_PDCRD_PD4_Msk                       /*!< Pin PD4 Pull-Down set */
#define PWR_PDCRD_PD5_Pos              (5U)                                    
#define PWR_PDCRD_PD5_Msk              (0x1UL << PWR_PDCRD_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRD_PD5                  PWR_PDCRD_PD5_Msk                       /*!< Pin PD5 Pull-Down set */
#define PWR_PDCRD_PD6_Pos              (6U)                                    
#define PWR_PDCRD_PD6_Msk              (0x1UL << PWR_PDCRD_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRD_PD6                  PWR_PDCRD_PD6_Msk                       /*!< Pin PD6 Pull-Down set */
#define PWR_PDCRD_PD8_Pos              (8U)                                    
#define PWR_PDCRD_PD8_Msk              (0x1UL << PWR_PDCRD_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRD_PD8                  PWR_PDCRD_PD8_Msk                       /*!< Pin PD8 Pull-Down set */
#define PWR_PDCRD_PD9_Pos              (9U)                                    
#define PWR_PDCRD_PD9_Msk              (0x1UL << PWR_PDCRD_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRD_PD9                  PWR_PDCRD_PD9_Msk                       /*!< Pin PD9 Pull-Down set */
#define PWR_PDCRD_PD10_Pos             (10U)                                   
#define PWR_PDCRD_PD10_Msk             (0x1UL << PWR_PDCRD_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRD_PD10                 PWR_PDCRD_PD10_Msk                      /*!< Pin PD10 Pull-Down set */
#define PWR_PDCRD_PD11_Pos             (11U)                                   
#define PWR_PDCRD_PD11_Msk             (0x1UL << PWR_PDCRD_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRD_PD11                 PWR_PDCRD_PD11_Msk                      /*!< Pin PD11 Pull-Down set */
#define PWR_PDCRD_PD12_Pos             (12U)                                   
#define PWR_PDCRD_PD12_Msk             (0x1UL << PWR_PDCRD_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRD_PD12                 PWR_PDCRD_PD12_Msk                      /*!< Pin PD12 Pull-Down set */
#define PWR_PDCRD_PD13_Pos             (13U)                                   
#define PWR_PDCRD_PD13_Msk             (0x1UL << PWR_PDCRD_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRD_PD13                 PWR_PDCRD_PD13_Msk                      /*!< Pin PD13 Pull-Down set */
#define PWR_PDCRD_PD14_Pos             (14U)                                   
#define PWR_PDCRD_PD14_Msk             (0x1UL << PWR_PDCRD_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRD_PD14                 PWR_PDCRD_PD14_Msk                      /*!< Pin PD14 Pull-Down set */
#define PWR_PDCRD_PD15_Pos             (15U)                                   
#define PWR_PDCRD_PD15_Msk             (0x1UL << PWR_PDCRD_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRD_PD15                 PWR_PDCRD_PD15_Msk                      /*!< Pin PD15 Pull-Down set */

