ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb55xx.h
/********************  Bit definition for RCC_C2APB1SMENR1 register  **************/
#define RCC_C2APB1SMENR1_TIM2SMEN_Pos      (0U)                               
#define RCC_C2APB1SMENR1_TIM2SMEN_Msk      (0x1UL << RCC_C2APB1SMENR1_TIM2SMEN_Pos) /*!< 0x00000001 */
#define RCC_C2APB1SMENR1_TIM2SMEN          RCC_C2APB1SMENR1_TIM2SMEN_Msk     
#define RCC_C2APB1SMENR1_LCDSMEN_Pos       (9U)                               
#define RCC_C2APB1SMENR1_LCDSMEN_Msk       (0x1UL << RCC_C2APB1SMENR1_LCDSMEN_Pos) /*!< 0x00000200 */
#define RCC_C2APB1SMENR1_LCDSMEN           RCC_C2APB1SMENR1_LCDSMEN_Msk      
#define RCC_C2APB1SMENR1_RTCAPBSMEN_Pos    (10U)                              
#define RCC_C2APB1SMENR1_RTCAPBSMEN_Msk    (0x1UL << RCC_C2APB1SMENR1_RTCAPBSMEN_Pos) /*!< 0x00000400 */
#define RCC_C2APB1SMENR1_RTCAPBSMEN        RCC_C2APB1SMENR1_RTCAPBSMEN_Msk   
#define RCC_C2APB1SMENR1_SPI2SMEN_Pos      (14U)                              
#define RCC_C2APB1SMENR1_SPI2SMEN_Msk      (0x1UL << RCC_C2APB1SMENR1_SPI2SMEN_Pos) /*!< 0x00004000 */
#define RCC_C2APB1SMENR1_SPI2SMEN          RCC_C2APB1SMENR1_SPI2SMEN_Msk     
#define RCC_C2APB1SMENR1_I2C1SMEN_Pos      (21U)                              
#define RCC_C2APB1SMENR1_I2C1SMEN_Msk      (0x1UL << RCC_C2APB1SMENR1_I2C1SMEN_Pos) /*!< 0x00200000 */
#define RCC_C2APB1SMENR1_I2C1SMEN          RCC_C2APB1SMENR1_I2C1SMEN_Msk     
#define RCC_C2APB1SMENR1_I2C3SMEN_Pos      (23U)                              
#define RCC_C2APB1SMENR1_I2C3SMEN_Msk      (0x1UL << RCC_C2APB1SMENR1_I2C3SMEN_Pos) /*!< 0x00800000 */
#define RCC_C2APB1SMENR1_I2C3SMEN          RCC_C2APB1SMENR1_I2C3SMEN_Msk     
#define RCC_C2APB1SMENR1_CRSSMEN_Pos       (24U)                              
#define RCC_C2APB1SMENR1_CRSSMEN_Msk       (0x1UL << RCC_C2APB1SMENR1_CRSSMEN_Pos) /*!< 0x01000000 */
#define RCC_C2APB1SMENR1_CRSSMEN           RCC_C2APB1SMENR1_CRSSMEN_Msk      
#define RCC_C2APB1SMENR1_USBSMEN_Pos       (26U)                              
#define RCC_C2APB1SMENR1_USBSMEN_Msk       (0x1UL << RCC_C2APB1SMENR1_USBSMEN_Pos) /*!< 0x04000000 */
#define RCC_C2APB1SMENR1_USBSMEN           RCC_C2APB1SMENR1_USBSMEN_Msk    
#define RCC_C2APB1SMENR1_LPTIM1SMEN_Pos    (31U)                              
#define RCC_C2APB1SMENR1_LPTIM1SMEN_Msk    (0x1UL << RCC_C2APB1SMENR1_LPTIM1SMEN_Pos) /*!< 0x80000000 */
#define RCC_C2APB1SMENR1_LPTIM1SMEN        RCC_C2APB1SMENR1_LPTIM1SMEN_Msk   

/********************  Bit definition for RCC_C2APB1SMENR2 register  **************/
#define RCC_C2APB1SMENR2_LPUART1SMEN_Pos    (0U)                               
#define RCC_C2APB1SMENR2_LPUART1SMEN_Msk    (0x1UL << RCC_C2APB1SMENR2_LPUART1SMEN_Pos) /*!< 0x00000001 */
#define RCC_C2APB1SMENR2_LPUART1SMEN        RCC_C2APB1SMENR2_LPUART1SMEN_Msk   
#define RCC_C2APB1SMENR2_LPTIM2SMEN_Pos     (5U)                               
#define RCC_C2APB1SMENR2_LPTIM2SMEN_Msk     (0x1UL << RCC_C2APB1SMENR2_LPTIM2SMEN_Pos) /*!< 0x00000020 */
#define RCC_C2APB1SMENR2_LPTIM2SMEN         RCC_C2APB1SMENR2_LPTIM2SMEN_Msk   
 
/********************  Bit definition for RCC_C2APB2SMENR register  **************/
#define RCC_C2APB2SMENR_TIM1SMEN_Pos       (11U)                              
#define RCC_C2APB2SMENR_TIM1SMEN_Msk       (0x1UL << RCC_C2APB2SMENR_TIM1SMEN_Pos)   /*!< 0x00000800 */
#define RCC_C2APB2SMENR_TIM1SMEN           RCC_C2APB2SMENR_TIM1SMEN_Msk      
#define RCC_C2APB2SMENR_SPI1SMEN_Pos       (12U)                              
#define RCC_C2APB2SMENR_SPI1SMEN_Msk       (0x1UL << RCC_C2APB2SMENR_SPI1SMEN_Pos)   /*!< 0x00001000 */
#define RCC_C2APB2SMENR_SPI1SMEN           RCC_C2APB2SMENR_SPI1SMEN_Msk      
#define RCC_C2APB2SMENR_USART1SMEN_Pos     (14U)                              
#define RCC_C2APB2SMENR_USART1SMEN_Msk     (0x1UL << RCC_C2APB2SMENR_USART1SMEN_Pos) /*!< 0x00004000 */
#define RCC_C2APB2SMENR_USART1SMEN         RCC_C2APB2SMENR_USART1SMEN_Msk    
#define RCC_C2APB2SMENR_TIM16SMEN_Pos      (17U)                              
#define RCC_C2APB2SMENR_TIM16SMEN_Msk      (0x1UL << RCC_C2APB2SMENR_TIM16SMEN_Pos)  /*!< 0x00020000 */
#define RCC_C2APB2SMENR_TIM16SMEN          RCC_C2APB2SMENR_TIM16SMEN_Msk     
#define RCC_C2APB2SMENR_TIM17SMEN_Pos      (18U)                              
#define RCC_C2APB2SMENR_TIM17SMEN_Msk      (0x1UL << RCC_C2APB2SMENR_TIM17SMEN_Pos)  /*!< 0x00040000 */
#define RCC_C2APB2SMENR_TIM17SMEN          RCC_C2APB2SMENR_TIM17SMEN_Msk     
#define RCC_C2APB2SMENR_SAI1SMEN_Pos       (21U)                              
#define RCC_C2APB2SMENR_SAI1SMEN_Msk       (0x1UL << RCC_C2APB2SMENR_SAI1SMEN_Pos)   /*!< 0x00200000 */
#define RCC_C2APB2SMENR_SAI1SMEN           RCC_C2APB2SMENR_SAI1SMEN_Msk       

/********************  Bit definition for RCC_C2APB3SMENR register  **************/
#define RCC_C2APB3SMENR_BLESMEN_Pos        (0U)                               
#define RCC_C2APB3SMENR_BLESMEN_Msk        (0x1UL << RCC_C2APB3SMENR_BLESMEN_Pos) /*!< 0x00000001 */
#define RCC_C2APB3SMENR_BLESMEN            RCC_C2APB3SMENR_BLESMEN_Msk       
#define RCC_C2APB3SMENR_802SMEN_Pos        (1U)                               
#define RCC_C2APB3SMENR_802SMEN_Msk        (0x1UL << RCC_C2APB3SMENR_802SMEN_Pos) /*!< 0x00000002 */
#define RCC_C2APB3SMENR_802SMEN            RCC_C2APB3SMENR_802SMEN_Msk       

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for  register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)                                               
#define RNG_CR_RNGEN_Msk    (0x1UL << RNG_CR_RNGEN_Pos)                        /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk                                   
#define RNG_CR_IE_Pos       (3U)                                               
#define RNG_CR_IE_Msk       (0x1UL << RNG_CR_IE_Pos)                           /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk                                      
#define RNG_CR_CED_Pos      (5U)                                               
#define RNG_CR_CED_Msk      (0x1UL << RNG_CR_CED_Pos)                          /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk                                     

