ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb55xx.h
/*****************  Bit definition for SYSCFG_SWPR1 register  (SYSCFG SRAM2A write protection register) *********************************************************/
#define SYSCFG_SWPR1_PAGE0_Pos                  (0U)                           
#define SYSCFG_SWPR1_PAGE0_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE0_Pos)               /*!< 0x00000001 */
#define SYSCFG_SWPR1_PAGE0                      SYSCFG_SWPR1_PAGE0_Msk                          /*!< SRAM2A Write protection page 0 (0x20030000 – 0x200303FF)   */
#define SYSCFG_SWPR1_PAGE1_Pos                  (1U)                           
#define SYSCFG_SWPR1_PAGE1_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE1_Pos)               /*!< 0x00000002 */
#define SYSCFG_SWPR1_PAGE1                      SYSCFG_SWPR1_PAGE1_Msk                          /*!< SRAM2A Write protection page 1 (0x20030400 – 0x200307FF)   */
#define SYSCFG_SWPR1_PAGE2_Pos                  (2U)                           
#define SYSCFG_SWPR1_PAGE2_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE2_Pos)               /*!< 0x00000004 */
#define SYSCFG_SWPR1_PAGE2                      SYSCFG_SWPR1_PAGE2_Msk                          /*!< SRAM2A Write protection page 2 (0x20030800 – 0x20030BFF)   */
#define SYSCFG_SWPR1_PAGE3_Pos                  (3U)                           
#define SYSCFG_SWPR1_PAGE3_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE3_Pos)               /*!< 0x00000008 */
#define SYSCFG_SWPR1_PAGE3                      SYSCFG_SWPR1_PAGE3_Msk                          /*!< SRAM2A Write protection page 3 (0x20030C00 – 0x20030FFF)   */
#define SYSCFG_SWPR1_PAGE4_Pos                  (4U)                           
#define SYSCFG_SWPR1_PAGE4_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE4_Pos)               /*!< 0x00000010 */
#define SYSCFG_SWPR1_PAGE4                      SYSCFG_SWPR1_PAGE4_Msk                          /*!< SRAM2A Write protection page 4 (0x20031000 – 0x200313FF)   */
#define SYSCFG_SWPR1_PAGE5_Pos                  (5U)                           
#define SYSCFG_SWPR1_PAGE5_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE5_Pos)               /*!< 0x00000020 */
#define SYSCFG_SWPR1_PAGE5                      SYSCFG_SWPR1_PAGE5_Msk                          /*!< SRAM2A Write protection page 5 (0x20031400 – 0x200317FF)   */
#define SYSCFG_SWPR1_PAGE6_Pos                  (6U)                           
#define SYSCFG_SWPR1_PAGE6_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE6_Pos)               /*!< 0x00000040 */
#define SYSCFG_SWPR1_PAGE6                      SYSCFG_SWPR1_PAGE6_Msk                          /*!< SRAM2A Write protection page 6 (0x20031800 – 0x20031BFF)   */
#define SYSCFG_SWPR1_PAGE7_Pos                  (7U)                           
#define SYSCFG_SWPR1_PAGE7_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE7_Pos)               /*!< 0x00000080 */
#define SYSCFG_SWPR1_PAGE7                      SYSCFG_SWPR1_PAGE7_Msk                          /*!< SRAM2A Write protection page 7 (0x20031C00 – 0x20031FFF)   */
#define SYSCFG_SWPR1_PAGE8_Pos                  (8U)                           
#define SYSCFG_SWPR1_PAGE8_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE8_Pos)               /*!< 0x00000100 */
#define SYSCFG_SWPR1_PAGE8                      SYSCFG_SWPR1_PAGE8_Msk                          /*!< SRAM2A Write protection page 8 (0x20032000 – 0x200323FF)   */
#define SYSCFG_SWPR1_PAGE9_Pos                  (9U)                           
#define SYSCFG_SWPR1_PAGE9_Msk                  (0x1UL << SYSCFG_SWPR1_PAGE9_Pos)               /*!< 0x00000200 */
#define SYSCFG_SWPR1_PAGE9                      SYSCFG_SWPR1_PAGE9_Msk                          /*!< SRAM2A Write protection page 9 (0x20032400 – 0x200327FF)   */
#define SYSCFG_SWPR1_PAGE10_Pos                 (10U)                          
#define SYSCFG_SWPR1_PAGE10_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE10_Pos)              /*!< 0x00000400 */
#define SYSCFG_SWPR1_PAGE10                     SYSCFG_SWPR1_PAGE10_Msk                         /*!< SRAM2A Write protection page 10 (0x20032800 – 0x20032BFF)  */
#define SYSCFG_SWPR1_PAGE11_Pos                 (11U)                          
#define SYSCFG_SWPR1_PAGE11_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE11_Pos)              /*!< 0x00000800 */
#define SYSCFG_SWPR1_PAGE11                     SYSCFG_SWPR1_PAGE11_Msk                         /*!< SRAM2A Write protection page 11 (0x20032C00 – 0x20032FFF)  */
#define SYSCFG_SWPR1_PAGE12_Pos                 (12U)                          
#define SYSCFG_SWPR1_PAGE12_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE12_Pos)              /*!< 0x00001000 */
#define SYSCFG_SWPR1_PAGE12                     SYSCFG_SWPR1_PAGE12_Msk                         /*!< SRAM2A Write protection page 12 (0x20033000 – 0x200333FF)  */
#define SYSCFG_SWPR1_PAGE13_Pos                 (13U)                          
#define SYSCFG_SWPR1_PAGE13_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE13_Pos)              /*!< 0x00002000 */
#define SYSCFG_SWPR1_PAGE13                     SYSCFG_SWPR1_PAGE13_Msk                         /*!< SRAM2A Write protection page 13 (0x20033400 – 0x200337FF)  */
#define SYSCFG_SWPR1_PAGE14_Pos                 (14U)                          
#define SYSCFG_SWPR1_PAGE14_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE14_Pos)              /*!< 0x00004000 */
#define SYSCFG_SWPR1_PAGE14                     SYSCFG_SWPR1_PAGE14_Msk                         /*!< SRAM2A Write protection page 14 (0x20033800 – 0x20033BFF)  */
#define SYSCFG_SWPR1_PAGE15_Pos                 (15U)                          
#define SYSCFG_SWPR1_PAGE15_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE15_Pos)              /*!< 0x00008000 */
#define SYSCFG_SWPR1_PAGE15                     SYSCFG_SWPR1_PAGE15_Msk                         /*!< SRAM2A Write protection page 15 (0x20033C00 – 0x20033FFF)  */
#define SYSCFG_SWPR1_PAGE16_Pos                 (16U)                          
#define SYSCFG_SWPR1_PAGE16_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE16_Pos)              /*!< 0x00010000 */
#define SYSCFG_SWPR1_PAGE16                     SYSCFG_SWPR1_PAGE16_Msk                         /*!< SRAM2A Write protection page 16 (0x20034000 – 0x200343FF)  */
#define SYSCFG_SWPR1_PAGE17_Pos                 (17U)                          
#define SYSCFG_SWPR1_PAGE17_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE17_Pos)              /*!< 0x00020000 */
#define SYSCFG_SWPR1_PAGE17                     SYSCFG_SWPR1_PAGE17_Msk                         /*!< SRAM2A Write protection page 17 (0x20034400 – 0x200347FF)  */
#define SYSCFG_SWPR1_PAGE18_Pos                 (18U)                          
#define SYSCFG_SWPR1_PAGE18_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE18_Pos)              /*!< 0x00040000 */
#define SYSCFG_SWPR1_PAGE18                     SYSCFG_SWPR1_PAGE18_Msk                         /*!< SRAM2A Write protection page 18 (0x20034800 – 0x20034BFF)  */
#define SYSCFG_SWPR1_PAGE19_Pos                 (19U)                          
#define SYSCFG_SWPR1_PAGE19_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE19_Pos)              /*!< 0x00080000 */
#define SYSCFG_SWPR1_PAGE19                     SYSCFG_SWPR1_PAGE19_Msk                         /*!< SRAM2A Write protection page 19 (0x20034C00 – 0x20034FFF)  */
#define SYSCFG_SWPR1_PAGE20_Pos                 (20U)                          
#define SYSCFG_SWPR1_PAGE20_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE20_Pos)              /*!< 0x00100000 */
#define SYSCFG_SWPR1_PAGE20                     SYSCFG_SWPR1_PAGE20_Msk                         /*!< SRAM2A Write protection page 20 (0x20035000 – 0x200353FF)  */
#define SYSCFG_SWPR1_PAGE21_Pos                 (21U)                          
#define SYSCFG_SWPR1_PAGE21_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE21_Pos)              /*!< 0x00200000 */
#define SYSCFG_SWPR1_PAGE21                     SYSCFG_SWPR1_PAGE21_Msk                         /*!< SRAM2A Write protection page 21 (0x20035400 – 0x200357FF)  */
#define SYSCFG_SWPR1_PAGE22_Pos                 (22U)                          
#define SYSCFG_SWPR1_PAGE22_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE22_Pos)              /*!< 0x00400000 */
#define SYSCFG_SWPR1_PAGE22                     SYSCFG_SWPR1_PAGE22_Msk                         /*!< SRAM2A Write protection page 22 (0x20035800 – 0x20035BFF)  */
#define SYSCFG_SWPR1_PAGE23_Pos                 (23U)                          
#define SYSCFG_SWPR1_PAGE23_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE23_Pos)              /*!< 0x00800000 */
#define SYSCFG_SWPR1_PAGE23                     SYSCFG_SWPR1_PAGE23_Msk                         /*!< SRAM2A Write protection page 23 (0x20035C00 – 0x20035FFF)  */
#define SYSCFG_SWPR1_PAGE24_Pos                 (24U)                          
#define SYSCFG_SWPR1_PAGE24_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE24_Pos)              /*!< 0x01000000 */
#define SYSCFG_SWPR1_PAGE24                     SYSCFG_SWPR1_PAGE24_Msk                         /*!< SRAM2A Write protection page 24 (0x20036000 – 0x200363FF)  */
#define SYSCFG_SWPR1_PAGE25_Pos                 (25U)                          
#define SYSCFG_SWPR1_PAGE25_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE25_Pos)              /*!< 0x02000000 */
#define SYSCFG_SWPR1_PAGE25                     SYSCFG_SWPR1_PAGE25_Msk                         /*!< SRAM2A Write protection page 25 (0x20036400 – 0x200367FF)  */
#define SYSCFG_SWPR1_PAGE26_Pos                 (26U)                          
#define SYSCFG_SWPR1_PAGE26_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE26_Pos)              /*!< 0x04000000 */
#define SYSCFG_SWPR1_PAGE26                     SYSCFG_SWPR1_PAGE26_Msk                         /*!< SRAM2A Write protection page 26 (0x20036800 – 0x20036BFF)  */
#define SYSCFG_SWPR1_PAGE27_Pos                 (27U)                          
#define SYSCFG_SWPR1_PAGE27_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE27_Pos)              /*!< 0x08000000 */
#define SYSCFG_SWPR1_PAGE27                     SYSCFG_SWPR1_PAGE27_Msk                         /*!< SRAM2A Write protection page 27 (0x20036C00 – 0x20036FFF)  */
#define SYSCFG_SWPR1_PAGE28_Pos                 (28U)                          
#define SYSCFG_SWPR1_PAGE28_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE28_Pos)              /*!< 0x10000000 */
#define SYSCFG_SWPR1_PAGE28                     SYSCFG_SWPR1_PAGE28_Msk                         /*!< SRAM2A Write protection page 28 (0x20037000 – 0x200373FF)  */
#define SYSCFG_SWPR1_PAGE29_Pos                 (29U)                          
#define SYSCFG_SWPR1_PAGE29_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE29_Pos)              /*!< 0x20000000 */
#define SYSCFG_SWPR1_PAGE29                     SYSCFG_SWPR1_PAGE29_Msk                         /*!< SRAM2A Write protection page 29 (0x20037400 – 0x200377FF)  */
#define SYSCFG_SWPR1_PAGE30_Pos                 (30U)                          
#define SYSCFG_SWPR1_PAGE30_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE30_Pos)              /*!< 0x40000000 */
#define SYSCFG_SWPR1_PAGE30                     SYSCFG_SWPR1_PAGE30_Msk                         /*!< SRAM2A Write protection page 30 (0x20037800 – 0x20037BFF)  */
#define SYSCFG_SWPR1_PAGE31_Pos                 (31U)                          
#define SYSCFG_SWPR1_PAGE31_Msk                 (0x1UL << SYSCFG_SWPR1_PAGE31_Pos)              /*!< 0x80000000 */
#define SYSCFG_SWPR1_PAGE31                     SYSCFG_SWPR1_PAGE31_Msk                         /*!< SRAM2A Write protection page 31 (0x20037C00 – 0x20037FFF)  */

/*****************  Bit definition for SYSCFG_SKR register  (SYSCFG SRAM2 key register) *************************************************************************/
#define SYSCFG_SKR_KEY_Pos                      (0U)                           
#define SYSCFG_SKR_KEY_Msk                      (0xFFUL << SYSCFG_SKR_KEY_Pos)                  /*!< 0x000000FF */
#define SYSCFG_SKR_KEY                          SYSCFG_SKR_KEY_Msk                              /*!< SRAM2 write protection key for software erase              */

/*****************  Bit definition for SYSCFG_SWPR2 register  (SYSCFG SRAM2 write protection register) **********************************************************/
#define SYSCFG_SWPR2_PAGE32_Pos                 (0U)                           
#define SYSCFG_SWPR2_PAGE32_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE32_Pos)              /*!< 0x00000001 */
#define SYSCFG_SWPR2_PAGE32                     SYSCFG_SWPR2_PAGE32_Msk                         /*!< SRAM2B Write protection page 0 (0x20038000 – 0x200383FF)   */
#define SYSCFG_SWPR2_PAGE33_Pos                 (1U)                           
#define SYSCFG_SWPR2_PAGE33_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE33_Pos)              /*!< 0x00000002 */
#define SYSCFG_SWPR2_PAGE33                     SYSCFG_SWPR2_PAGE33_Msk                         /*!< SRAM2B Write protection page 1 (0x20038400 – 0x200387FF)   */
#define SYSCFG_SWPR2_PAGE34_Pos                 (2U)                           
#define SYSCFG_SWPR2_PAGE34_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE34_Pos)              /*!< 0x00000004 */
#define SYSCFG_SWPR2_PAGE34                     SYSCFG_SWPR2_PAGE34_Msk                         /*!< SRAM2B Write protection page 2 (0x20038800 – 0x20038bFF)   */
#define SYSCFG_SWPR2_PAGE35_Pos                 (3U)                           
#define SYSCFG_SWPR2_PAGE35_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE35_Pos)              /*!< 0x00000008 */
#define SYSCFG_SWPR2_PAGE35                     SYSCFG_SWPR2_PAGE35_Msk                         /*!< SRAM2B Write protection page 3 (0x20038C00 – 0x20038FFF)   */
#define SYSCFG_SWPR2_PAGE36_Pos                 (4U)                           
#define SYSCFG_SWPR2_PAGE36_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE36_Pos)              /*!< 0x00000010 */
#define SYSCFG_SWPR2_PAGE36                     SYSCFG_SWPR2_PAGE36_Msk                         /*!< SRAM2B Write protection page 4 (0x20039000 – 0x200393FF)   */
#define SYSCFG_SWPR2_PAGE37_Pos                 (5U)                           
#define SYSCFG_SWPR2_PAGE37_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE37_Pos)              /*!< 0x00000020 */
#define SYSCFG_SWPR2_PAGE37                     SYSCFG_SWPR2_PAGE37_Msk                         /*!< SRAM2B Write protection page 5 (0x20039400 – 0x200397FF)   */
#define SYSCFG_SWPR2_PAGE38_Pos                 (6U)                           
#define SYSCFG_SWPR2_PAGE38_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE38_Pos)              /*!< 0x00000040 */
#define SYSCFG_SWPR2_PAGE38                     SYSCFG_SWPR2_PAGE38_Msk                         /*!< SRAM2B Write protection page 6 (0x20039800 – 0x20039BFF)   */
#define SYSCFG_SWPR2_PAGE39_Pos                 (7U)                           
#define SYSCFG_SWPR2_PAGE39_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE39_Pos)              /*!< 0x00000080 */
#define SYSCFG_SWPR2_PAGE39                     SYSCFG_SWPR2_PAGE39_Msk                         /*!< SRAM2B Write protection page 7 (0x20039C00 – 0x20039FFF)   */
#define SYSCFG_SWPR2_PAGE40_Pos                 (8U)                           
#define SYSCFG_SWPR2_PAGE40_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE40_Pos)              /*!< 0x00000100 */
#define SYSCFG_SWPR2_PAGE40                     SYSCFG_SWPR2_PAGE40_Msk                         /*!< SRAM2B Write protection page 8 (0x2003A000 – 0x2003A3FF)   */
#define SYSCFG_SWPR2_PAGE41_Pos                 (9U)                           
#define SYSCFG_SWPR2_PAGE41_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE41_Pos)              /*!< 0x00000200 */
#define SYSCFG_SWPR2_PAGE41                     SYSCFG_SWPR2_PAGE41_Msk                         /*!< SRAM2B Write protection page 9 (0x2003A400 – 0x2003A7FF)   */
#define SYSCFG_SWPR2_PAGE42_Pos                 (10U)                          
#define SYSCFG_SWPR2_PAGE42_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE42_Pos)              /*!< 0x00000400 */
#define SYSCFG_SWPR2_PAGE42                     SYSCFG_SWPR2_PAGE42_Msk                         /*!< SRAM2B Write protection page 10 (0x2003A800 – 0x2003ABFF)  */
#define SYSCFG_SWPR2_PAGE43_Pos                 (11U)                          
#define SYSCFG_SWPR2_PAGE43_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE43_Pos)              /*!< 0x00000800 */
#define SYSCFG_SWPR2_PAGE43                     SYSCFG_SWPR2_PAGE43_Msk                         /*!< SRAM2B Write protection page 11 (0x2003AC00 – 0x2003AFFF)  */
#define SYSCFG_SWPR2_PAGE44_Pos                 (12U)                          
#define SYSCFG_SWPR2_PAGE44_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE44_Pos)              /*!< 0x00001000 */
#define SYSCFG_SWPR2_PAGE44                     SYSCFG_SWPR2_PAGE44_Msk                         /*!< SRAM2B Write protection page 12 (0x2003B000 – 0x2003B3FF)  */
#define SYSCFG_SWPR2_PAGE45_Pos                 (13U)                          
#define SYSCFG_SWPR2_PAGE45_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE45_Pos)              /*!< 0x00002000 */
#define SYSCFG_SWPR2_PAGE45                     SYSCFG_SWPR2_PAGE45_Msk                         /*!< SRAM2B Write protection page 13 (0x2003B400 – 0x2003B7FF)  */
#define SYSCFG_SWPR2_PAGE46_Pos                 (14U)                          
#define SYSCFG_SWPR2_PAGE46_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE46_Pos)              /*!< 0x00004000 */
#define SYSCFG_SWPR2_PAGE46                     SYSCFG_SWPR2_PAGE46_Msk                         /*!< SRAM2B Write protection page 14 (0x2003B800 – 0x2003BBFF)  */
#define SYSCFG_SWPR2_PAGE47_Pos                 (15U)                          
#define SYSCFG_SWPR2_PAGE47_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE47_Pos)              /*!< 0x00008000 */
#define SYSCFG_SWPR2_PAGE47                     SYSCFG_SWPR2_PAGE47_Msk                         /*!< SRAM2B Write protection page 15 (0x2003BC00 – 0x2003BFFF)  */
#define SYSCFG_SWPR2_PAGE48_Pos                 (16U)                          
#define SYSCFG_SWPR2_PAGE48_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE48_Pos)              /*!< 0x00010000 */
#define SYSCFG_SWPR2_PAGE48                     SYSCFG_SWPR2_PAGE48_Msk                         /*!< SRAM2B Write protection page 16 (0x2003C000 – 0x2003C3FF)  */
#define SYSCFG_SWPR2_PAGE49_Pos                 (17U)                          
#define SYSCFG_SWPR2_PAGE49_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE49_Pos)              /*!< 0x00020000 */
#define SYSCFG_SWPR2_PAGE49                     SYSCFG_SWPR2_PAGE49_Msk                         /*!< SRAM2B Write protection page 17 (0x2003C400 – 0x2003C7FF)  */
#define SYSCFG_SWPR2_PAGE50_Pos                 (18U)                          
#define SYSCFG_SWPR2_PAGE50_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE50_Pos)              /*!< 0x00040000 */
#define SYSCFG_SWPR2_PAGE50                     SYSCFG_SWPR2_PAGE50_Msk                         /*!< SRAM2B Write protection page 18 (0x2003C800 – 0x2003CBFF)  */
#define SYSCFG_SWPR2_PAGE51_Pos                 (19U)                          
#define SYSCFG_SWPR2_PAGE51_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE51_Pos)              /*!< 0x00080000 */
#define SYSCFG_SWPR2_PAGE51                     SYSCFG_SWPR2_PAGE51_Msk                         /*!< SRAM2B Write protection page 19 (0x2003CC00 – 0x2003CFFF)  */
#define SYSCFG_SWPR2_PAGE52_Pos                 (20U)                          
#define SYSCFG_SWPR2_PAGE52_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE52_Pos)              /*!< 0x00100000 */
#define SYSCFG_SWPR2_PAGE52                     SYSCFG_SWPR2_PAGE52_Msk                         /*!< SRAM2B Write protection page 20 (0x2003D000 – 0x2003D3FF)  */
#define SYSCFG_SWPR2_PAGE53_Pos                 (21U)                          
#define SYSCFG_SWPR2_PAGE53_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE53_Pos)              /*!< 0x00200000 */
#define SYSCFG_SWPR2_PAGE53                     SYSCFG_SWPR2_PAGE53_Msk                         /*!< SRAM2B Write protection page 21 (0x2003D400 – 0x2003D7FF)  */
#define SYSCFG_SWPR2_PAGE54_Pos                 (22U)                          
#define SYSCFG_SWPR2_PAGE54_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE54_Pos)              /*!< 0x00400000 */
#define SYSCFG_SWPR2_PAGE54                     SYSCFG_SWPR2_PAGE54_Msk                         /*!< SRAM2B Write protection page 22 (0x2003D800 – 0x2003DBFF)  */
#define SYSCFG_SWPR2_PAGE55_Pos                 (23U)                          
#define SYSCFG_SWPR2_PAGE55_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE55_Pos)              /*!< 0x00800000 */
#define SYSCFG_SWPR2_PAGE55                     SYSCFG_SWPR2_PAGE55_Msk                         /*!< SRAM2B Write protection page 23 (0x2003DC00 – 0x2003DFFF)  */
#define SYSCFG_SWPR2_PAGE56_Pos                 (24U)                          
#define SYSCFG_SWPR2_PAGE56_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE56_Pos)              /*!< 0x01000000 */
#define SYSCFG_SWPR2_PAGE56                     SYSCFG_SWPR2_PAGE56_Msk                         /*!< SRAM2B Write protection page 24 (0x2003E000 – 0x2003E3FF)  */
#define SYSCFG_SWPR2_PAGE57_Pos                 (25U)                          
#define SYSCFG_SWPR2_PAGE57_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE57_Pos)              /*!< 0x02000000 */
#define SYSCFG_SWPR2_PAGE57                     SYSCFG_SWPR2_PAGE57_Msk                         /*!< SRAM2B Write protection page 25 (0x2003E400 – 0x2003E7FF)  */
#define SYSCFG_SWPR2_PAGE58_Pos                 (26U)                          
#define SYSCFG_SWPR2_PAGE58_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE58_Pos)              /*!< 0x04000000 */
#define SYSCFG_SWPR2_PAGE58                     SYSCFG_SWPR2_PAGE58_Msk                         /*!< SRAM2B Write protection page 26 (0x2003E800 – 0x2003EBFF)  */
#define SYSCFG_SWPR2_PAGE59_Pos                 (27U)                          
#define SYSCFG_SWPR2_PAGE59_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE59_Pos)              /*!< 0x08000000 */
#define SYSCFG_SWPR2_PAGE59                     SYSCFG_SWPR2_PAGE59_Msk                         /*!< SRAM2B Write protection page 27 (0x2003EC00 – 0x2003EFFF)  */
#define SYSCFG_SWPR2_PAGE60_Pos                 (28U)                          
#define SYSCFG_SWPR2_PAGE60_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE60_Pos)              /*!< 0x10000000 */
#define SYSCFG_SWPR2_PAGE60                     SYSCFG_SWPR2_PAGE60_Msk                         /*!< SRAM2B Write protection page 28 (0x2003F000 – 0x2003F3FF)  */
#define SYSCFG_SWPR2_PAGE61_Pos                 (29U)                          
#define SYSCFG_SWPR2_PAGE61_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE61_Pos)              /*!< 0x20000000 */
#define SYSCFG_SWPR2_PAGE61                     SYSCFG_SWPR2_PAGE61_Msk                         /*!< SRAM2B Write protection page 29 (0x2003F400 – 0x2003F7FF)  */
#define SYSCFG_SWPR2_PAGE62_Pos                 (30U)                          
#define SYSCFG_SWPR2_PAGE62_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE62_Pos)              /*!< 0x40000000 */
#define SYSCFG_SWPR2_PAGE62                     SYSCFG_SWPR2_PAGE62_Msk                         /*!< SRAM2B Write protection page 30 (0x2003F800 – 0x2003FBFF)  */
#define SYSCFG_SWPR2_PAGE63_Pos                 (31U)                          
#define SYSCFG_SWPR2_PAGE63_Msk                 (0x1UL << SYSCFG_SWPR2_PAGE63_Pos)              /*!< 0x80000000 */
#define SYSCFG_SWPR2_PAGE63                     SYSCFG_SWPR2_PAGE63_Msk                         /*!< SRAM2B Write protection page 31 (0x2003FC00 – 0x2003FFFF)  */

